# 1. 继承

+ 继承: 面向对象三大特性之一，在定义一个新的类 B 时，如果该类与某个已有的类 A 相似(指的是 B 拥有 A 的全部特点)，那么就可以把 A 作为一个 **基类**，而把 B 作为基类的一个 **派生类(也叫子类)**。
+ 派生类是通过对基类进行修改和扩充得到的，在派生类中，可以扩充新的成员变量和成员函数。
+ 派生类一经定义后，可以独立使用，不依赖与基类。
+ 派生类拥有基类的全部成员函数和成员变量，无论是 public， private， protected。
+ 在派生类的各个成员函数中，不能访问基类中的 private 成员
+ 派生类的写法是: 类名: public 基类名
+ 父类，称为基类
+ 子类，称为派生类
+ 语法：`class Java : public BasePage {  };`

```cpp
#include <iostream>

using namespace std;

class BasePage {
public:
    void header() {
        cout << "首页，公开课，登录，注册。。。。。" << endl;
    }

    void footer() {
        cout << "帮助中心，交流合作，站内地图。。。。。" << endl;
    }

    void left() {
        cout << "JAVA，Python，C++。。。。。" << endl;
    }
};


class Java : public BasePage {
public:
    Java() {
        cout << "JAVA 课程视频页面" << endl;
    }

    static void content() {
        cout << "JAVA 学科课程视频。。。。。" << endl;
    }
};

class Python : public BasePage {
public:
    Python() {
        cout << "Python 课程视频页面" << endl;
    }

    static void content() {
        cout << "Python 学科课程视频。。。。。" << endl;
    }
};

class Cpp : public BasePage {
public:
    Cpp() {
        cout << "Cpp 课程视频页面" << endl;
    }

    static void content() {
        cout << "Cpp 学科课程视频。。。。。" << endl;
    }
};

void console() {
    cout << "-----------------------------------" << endl;
}


void test01() {
    Java ja;
    ja.header();
    ja.footer();
    ja.left();
    Java::content();

    console();

    Python py;
    py.header();
    py.footer();
    py.left();
    Python::content();

    console();

    Cpp cpp;
    cpp.header();
    cpp.footer();
    cpp.left();
    Cpp::content();
};


int main() {
    test01();
    return 0;
}

```

```c++
class CStudent {
private:
    string sName;
    int nAge;
public:
    bool isThreeGood() {};

    void setName(const string &name) {
        sName = name;
    }
};

class CUndergraduateStudent : public CStudent {
private:
    int nDepartment;
public:
    // 覆盖基类的方法
    bool IsThreeGood() {
        return true;
    };

    // 派生类自己的方法
    bool isAssistant() {
        return false;
    };
};

class CGraduateStudent : public CStudent {
private:
    int nDepartment;
    char name[20];
public:
    int CountSalary() {
        return 10000;
    }
};
```

# 2. 继承方式
+ 父类的 private 成员，子类都不能访问

## 2.1 public 公有继承
+ 父类的 public 成员，在子类依然是 public 成员
+ 父类的 protected 成员，在子类依然是 protected 成员

## 2.2 protected 保护继承
+ 父类的 public 和 protected 成员，在子类都变成了 protected 成员

## 2.3 private 私有继承
+ 父类的 public 和 protected 成员，在子类都变成了 private 成员

```cpp
#include <iostream>

using namespace std;

void console() {
    cout << "-----------------------------------" << endl;
}

class Base1 {
public:
    int m_A;
protected:
    int m_B;
private:
    int m_C;
};

class Son1: public Base1 {
public:
    void func () {
        this->m_A = 10;
        this->m_B = 20;
        // 父类的 private 成员不能访问
        // this->m_C = 30;
    }
};

class Base2 {
public:
    int m_A;
protected:
    int m_B;
private:
    int m_C;
};

class Son2: protected Base2 {
public:
    void func () {
        this->m_A = 10;
        this->m_B = 20;
        // 父类的 private 成员不能访问
        // this->m_C = 30;
    }
};

class Base3 {
public:
    int m_A;
protected:
    int m_B;
private:
    int m_C;
};

class Son3: private Base3 {
public:
    void func () {
        this->m_A = 10;
        this->m_B = 20;
        // 父类的 private 成员不能访问
        // this->m_C = 30;
    }
};

void test01() {
    Son1 s1;
    s1.m_A = 10;
    // public 继承 不能访问 protected 成员
    // s1.m_B = 20;

    Son2 s2;
    // protected 继承，不能访问 public 和 protected 成员
    // s2.m_A = 10;
    // s2.m_B = 20;

    Son3 s3;
    // private 继承，不能访问 public 和 protected 成员
    // s3.m_A = 10;
    // s3.m_B = 20;
};


int main() {
    test01();
    return 0;
}
```

# 3. 继承中的对象模型
+ 父类中所有非静态成员属性都会被子类继承下去
+ 父类中私有成员属性，被编译器隐藏了，因此访问不到，但是确实是继承了
+ 利用 VS 开发人员命令提示工具查看对象模型
+ 在命令行输入 `cl /d1 reportSingleClassLayoutSon .\main.cpp`
+ reportSingleClassLayout 汇报单个类布局
+ Son 我们要查看的类名
+ main.cpp 是我们查看的类所在的文件

```cpp
#include <iostream>

using namespace std;

void console() {
    cout << "-----------------------------------" << endl;
}

class Base {
public:
    int m_A;

protected:
    int m_B;
private:
    int m_C;
};

class Son : public Base {
public:
    int m_D;
};

void test01() {
    // sizeof (Son) = 12
    cout << "sizeof (Base) = " << sizeof(Base) << endl;

    // sizeof (Son) = 16
    cout << "sizeof (Son) = " << sizeof(Son) << endl;
};


int main() {
    test01();
    return 0;
}
```

# 4. 继承中的构造和析构顺序
+ 子类继承父类后，当创建子类对象，也会调用父类的构造函数
+ 构造函数顺序：先构造父类，再构造子类
+ 析构函数顺序：与构造函数顺序相反，先析构子类，再析构父类

```cpp
#include <iostream>

using namespace std;

class Base {
public:
    Base () {
        cout << "Base 的构造函数" << endl;
    }

    ~Base () {
        cout << "Base 的析构函数" << endl;
    }
};

class Son: public Base {
public:
    Son () {
        cout << "Son 的构造函数" << endl;
    }

    ~Son () {
        cout << "Son 的析构函数" << endl;
    }
};

void test01() {
    Son s;
    // 打印顺序
    // Base 的构造函数
    // Son 的构造函数
    // Son 的析构函数
    // Base 的析构函数
};

int main() {
    test01();
    return 0;
}
```

# 5. 继承同名成员处理方式
+ 访问子类同名成员，直接访问即可
+ 访问父类同名成员，需要加作用域
+ 如果子类有父类同名的成员，那么子类直接全部覆盖掉父类的成员，此时子类需要加作用域来访问父类的成员

```cpp
#include <iostream>

using namespace std;

// 继承中同名成员的处理方式
class Base {
public:
    int m_A;

    Base() {
        this->m_A = 100;
    }

    void func () {
        cout << "Base func 函数调用" << endl;
    }

    void func (int) {
        cout << "Base func int 函数调用" << endl;
    }
};

class Son : public Base {
public:
    int m_A;

    Son() {
        this->m_A = 200;
    }

    void func () {
        cout << "Son func 函数调用" << endl;
    }

    void func (int) {
        cout << "Son func int 函数调用" << endl;
    }
};

void test01() {
    Son s;
    cout << "Son 里的 Base.m_A = " << s.Base::m_A << endl;
    cout << "Son 里的 s.m_A = " << s.m_A << endl;
    s.Base::func();
    s.Base::func(100);
    s.func();
    s.func(100);
};

int main() {
    test01();
    return 0;
}
```

# 6. 继承同名静态成员处理方式
+ 静态成员和非静态成员出现同名，处理方式一致
+ 访问子类同名成员，直接访问即可
+ 访问父类同名成员，需要加作用域

```cpp
#include <iostream>

using namespace std;

// 继承中静态同名成员的处理方式
class Base {
public:
    static int m_A;

    static void func() {
        cout << "Base static func" << endl;
    }
};

int Base::m_A = 100;

class Son : public Base {
public:
    static int m_A;

    static void func() {
        cout << "Son static func" << endl;
    }
};

int Son::m_A = 200;

void test01() {
    Son s1;
    // 1. 通过对象访问
    cout << "s1.Base::m_A = " << s1.Base::m_A << endl;
    cout << "s1::m_A = " << s1.m_A << endl;
    // 2. 通过类名访问
    cout << "Base::m_A = " << Base::m_A << endl;
    cout << "Son::Base::m_A = " << Son::Base::m_A << endl;
    cout << "Son::m_A = " << Son::m_A << endl;
    cout << "------静态同名函数-----" << endl;
    // 1. 通过对象访问
    s1.func();
    s1.Base::func();
    // 2. 通过类名访问
    Son::func();
    Son::Base::func();
};

int main() {
    test01();
    return 0;
}
```

# 7. 多继承语法
+ C++ 允许一个类继承多个类
+ 语法：`class 子类名: 继承方式 父类名1, 继承方式 父类名2... {}; `
+ 多继承可能会引发父类中有同名成员出现，需要加作用域区分
+ C++ 实际开发中不建议用多继承

```cpp
#include <iostream>

using namespace std;

// 继承中静态同名成员的处理方式
class Base1 {
public:
    int m_A;

    Base1() {
        this->m_A = 100;
    }
};

class Base2 {
public:
    int m_B;
    int m_A = 1000;
    Base2() {
        this->m_B = 200;
    }
};

class Son : public Base1, public Base2 {
public:
    int m_C;
    int m_D;

    Son() {
        this->m_C = 300;
        this->m_D = 400;
    }
};

void test01() {
    Son s1;
    cout << "s1.Base1::m_A = " << s1.Base1::m_A << endl;
    cout << "s1.Base2::m_A = " << s1.Base2::m_A << endl;
    cout << "s1.m_B = " << s1.m_B << endl;
    cout << "s1.m_C = " << s1.m_C << endl;
    cout << "s1.m_D = " << s1.m_D << endl;
    cout << "sizeof(Son) = " << sizeof(Son) << endl;
};

int main() {
    test01();
    return 0;
}
```

# 8. 菱形继承（钻石继承）
+ 两个派生类继承同一个基类
+ 某一个类同时继承两个派生类
+ A 是基类，B 和 C 都继承了 A，D 多继承了 B 和 C

```
    A
  /   \
B       C
  \   /
    D
```

+ 问题：
  + 导致数据有多份，资源浪费
+ 对象模型
```
main.cpp

class SheepTuo  size(8):
        +---
 0      | +--- (base class Sheep)
 0      | | +--- (base class Animal)
 0      | | | m_Age
        | | +---
        | +---
 4      | +--- (base class Tuo)
 4      | | +--- (base class Animal)
 4      | | | m_Age
        | | +---
        | +---
        +---
```

+ 利用虚继承可以解决菱形继承的问题
+ `class Sheep: virtual public Animal {};`

```
main.cpp

class SheepTuo  size(12):
        +---
 0      | +--- (base class Sheep)
 0      | | {vbptr}
        | +---
 4      | +--- (base class Tuo)
 4      | | {vbptr}
        | +---
        +---
        +--- (virtual base Animal)
 8      | m_Age
        +---

SheepTuo::$vbtable@Sheep@:
 0      | 0
 1      | 8 (SheepTuod(Sheep+0)Animal)

SheepTuo::$vbtable@Tuo@:
 0      | 0
 1      | 4 (SheepTuod(Tuo+0)Animal)
vbi:       class  offset o.vbptr  o.vbte fVtorDisp
          Animal       8       0       4 0
```

+ vbptr 虚基类指针，指向一个 vbtable(virtual base table) 虚基类表
  + v virtual
  + b base
  + ptr pointer
  + 第一个 vbtable 指向的是 SheepTuo::$vbtable@Sheep@:
  + 第二个 vbtable 指向的是 SheepTuo::$vbtable@Tuo@:

# 9. 派生类对象的内存空间
+ 派生类对象的体积，等于基类对象的体积，再加上派生类对象自己的成员变量的体积。
+ 在派生类对象中，包含着基类对象，而且基类对象的存储位置位于派生类对象新增成员变量之前。
```c++
class CBase {
    int v1, v2;
};

class CDerived: public CBase {
    int v3;
};
```

# 10. 继承关系和符合关系
+ 继承: **是**关系
  + 基类 A，B 是基类 A 的派生类
  + 逻辑上要求： 一个 B 对象也是一个 A 对象。
+ 符合: **有** 关系
  + 类 C 中有成员变量 k， k 是类 D 的对象， 则 C 和 D 是复合关系
  + 逻辑上要求: D 对象是 C 对象的固有属性或组成部分。

